Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyAttachedType Property
 Cannot copy attached detail group type without copying the model group type it refers to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyAttachedType { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyAttachedType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyAttachedType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace